{"data":{"site":{"siteMetadata":{"title":"System Preferences","author":"Tim Stewart"}},"markdownRemark":{"id":"116f9a56-bed2-5170-a5c4-17b8d4cd0556","excerpt":"One of my favorite projects, my friend Quentin and I spent a few weeks\nmy junior year building an audio frequency visualizer. While it ended up\nbeing on the…","html":"<p>One of my favorite projects, my friend Quentin and I spent a few weeks\nmy junior year building an audio frequency visualizer. While it ended up\nbeing on the smaller side codebase wise, it took a lot of research and\nmany revisions to come to fruition. Check out the <a href=\"https://github.com/TimtheStew/AudioSpectrumVisualizer\">source</a></p>\n<p>Since both Quentin and I have a deep love of music, and I’ve been fascinated\nwith the Fast Fourier Transform and it’s plethora of applications since my\nbusiness school days, it seemed a natural choice to build some sort of spectrum\nvisualizer. The other main idea that seemed appealing was doing something with a cluster\nof Raspberry Pis, but we weren’t sure what.</p>\n<h3>Initial Goals</h3>\n<p>This was one of the first times, aside from hackathons or personal projects,\nwhere we as students were given the go ahead to create or choose our own\nprojects. And so, like the naive young fools we were, we set ourselves some\nvery ambitious goals. Also, as we were still really keen on that Raspberry Pi\nidea, we managed to shove them in somewhere too. We wanted to build rhythm game with:</p>\n<ul>\n<li>\n<p>multiple color-schemes and display modes</p>\n<ul>\n<li>tap the arrow keys or click moving objects in time with music, etc.</li>\n</ul>\n</li>\n<li>Using OpenGL 4 to display 3d graphics</li>\n<li>Using MIT’s <a href=\"http://www.fftw.org/\">fftw</a> to perform the analysis</li>\n<li>All of this was to happen on a Raspberry Pi, and be controlled wirelessly (so you could\nplug it into a TV and play from your couch)</li>\n</ul>","frontmatter":{"title":"Frequency Visualizer Retrospective","date":"February 17, 2019"}}},"pageContext":{"slug":"/Frequency-Visualizer-Retrospective/","previous":{"fields":{"slug":"/Hello-World/"},"frontmatter":{"title":"Hello World! Blog Goals"}},"next":{"fields":{"slug":"/YFS-Retrospective/"},"frontmatter":{"title":"YFS - A Distributed Filesystem Retrospective"}}}}