{"data":{"site":{"siteMetadata":{"title":"System Preferences","author":"Tim Stewart"}},"markdownRemark":{"id":"116f9a56-bed2-5170-a5c4-17b8d4cd0556","excerpt":"One of my favorite projects, my friend Quentin and I spent a few weeks\nduring the first half of our junior year building an audio frequency visualizer. While it…","html":"<p>One of my favorite projects, my friend Quentin and I spent a few weeks\nduring the first half of our junior year building an audio frequency visualizer. While it ended up\nbeing on the smaller side codebase wise, it took a lot of research and\nmany revisions to come to fruition. Check out the <a href=\"https://github.com/TimtheStew/AudioSpectrumVisualizer\">source</a></p>\n<p>Since both Quentin and I have a deep love of music, and I’ve been fascinated\nwith the Fast Fourier Transform and it’s plethora of applications since my\nbusiness school days, it seemed a natural choice to build some sort of spectrum\nvisualizer. The other main idea that seemed appealing was doing something with a cluster\nof Raspberry Pis, but we weren’t sure what.</p>\n<p><img src=\"/sine-tones-4094d5c2b6fc461b35580ca046d859e4.gif\" alt=\"sine-tones\"></p>\n<p align=center>\n    <cite> Sine tones, increasing in frequency and decreasing in decibels </cite>\n</p>\n<h3>Initial Goals</h3>\n<p>This was one of the first times, aside from hackathons or personal projects,\nwhere we as students were given the go ahead to create or choose our own\nprojects. And so, like the naive young fools we were, we set ourselves some\nvery ambitious goals. Also, as we were still really keen on that Raspberry Pi\nidea, we managed to shove them in somewhere too. We wanted to build rhythm game with:</p>\n<ul>\n<li>\n<p>Multiple color-schemes and display modes</p>\n<ul>\n<li>tap keys or click moving objects in time with music, etc.</li>\n</ul>\n</li>\n<li>Using <a href=\"https://www.khronos.org/registry/OpenGL-Refpages/gl4/\">OpenGL 4</a> to display 3D graphics.</li>\n<li>Using MIT’s <a href=\"http://www.fftw.org/\">fftw</a> to perform the analysis.</li>\n<li>At the insistence of our professor, we were to do the FFT in real-time.</li>\n<li>All of this was to happen on a Raspberry Pi, and be controlled wirelessly. (so you could\nplug it into a TV and play from your couch)</li>\n</ul>\n<h3>The Big Mistake: Adjusting Goals for the Real-World</h3>\n<p>Unfortunately, we soon found out that not only were most of those goals unfeasible in\nthe few scant weeks we had (we were also both busy with other classes) they were also way\nover our heads technically. </p>\n<p>After about a week of bashing our heads against the wall that is OpenGl 4’s programmable pipeline,\nwe decided to instead used the fixed-function pipeline of OpenGL 2, and to do 2D graphics with it, as\nit seemed much more conquerable.  </p>\n<p>Neither of us had ever\ndeveloped a game at all, let alone in something as low level as OpenGL, so the interactive\ncomponent went by the wayside as well. </p>\n<p>As relative newbies to the FFT signal processing scene, we opted\nfor the more beginner friendly FFT module from <a href=\"https://docs.scipy.org/doc/numpy/reference/routines.fft.html\">NumPy</a>.\nFinally, as the rapberry pi’s we ordered weren’t set to arrive until shortly\nbefore it was due (too cheap to pay for express shipping) we dropped that as well. Though the\nubuntu version of the project probably wouldn’t be that hard to port over to a Pi.</p>\n<p>While it felt bad at the time to cut down our dreams for the project so much, it was worth it at\nthe end to produce a working program. It was also a big learning experience, if we had set more\nreasonable goals from the get go, we could have polished our project up a lot more at the end.</p>\n<p>For example, as you may notice, the gifs on this page dont look quite like a spectrum display you’d\nsee on a stereo system or from a music player. That’s because we display the frequency spectrum\nlinearly, instead of logarithmically. So the first 20% of the vertical bins should really take up most\nof the screen. We also never got around to labelling the axis with the Decibels or Frequencies. If we hadn’t\nwasted all that time starting to learn tools we didn’t end up using, we could have easily added\nthose features, as well as multiple color schemes. </p>\n<h3>The Good Part</h3>\n<p>While this project was beset with many downgrades, there were some nice moments along the way.</p>\n<p><img src=\"/mozart-violin-final-b146a6a11094e769c0495e0a85890235.gif\" alt=\"Mozart-Violin\"></p>\n<p align=center>\n    <cite> A couple seconds of Mozart's Symphony No.35 in D major IV - Finale Presto </cite>\n</p>\nWhile it could certainly be improved, our primitive syncing method works quite well. It turns out\nthe issue of syncing audio to graphics - or rather of keeping them synced once playback has begun, can be\nvery tricky, especially with audio longer than your average video game sound-effect. Evidence for this abounds in even \nmodern games, where slowdown often causes dialogue de-sync. \n<p>Our GUI create two processes,\none for openGL to display the graphics, and another python one for the analysis. The stdout of the analysis\nprocess is piped into the stdin for the input, then they both exec their respective programs, and playback\nbegins. </p>\n<p>I also learned a lot of how FFT’s like this need to be done, and the various pre-processing methods\nyou have to employ to get accurate data. You have to deal with multiple channels, filtering, and perhaps\nmost frustrating, windowing - because unless you generate your own sine tones, music is never going to\nbe periodic in a 1024 sample window. While conceptually windowing isn’t too hard to understand, adjusting\nfor it post-FFT was touch and go for a while there.</p>\n<p>In particular I remember the moment I finally got the FFT program to output the correct decibels.\nAfter a couple days of tweaking parameters and multipliers, finagling the high-pass filtering, and reading many,\nmany, guides on fourier audio analysis (all of which seemed to have a piece of what we needed, but not all)\nwhen my sine tone wav files actually gave me the output I was hoping for, I actually did a little\ndance in celebration. </p>\n<h3>Wrap-up</h3>\n<p>Even though we didn’t meet most of our initial goals, I still consider this project a success. I learned a lot,\nboth personally and technically. Afterwards I felt much better equipped to tackle the projects I wanted - I felt\nI could more realistically gauge the amount I’d be able to accomplish, or least learn how to gauge it by surveying\nthe landscape I desire to enter. I also picked up technical skills, in the basics of digital signal processing,\nfourier analysis, and OpenGL. Not to mention I sharpened my python teeth, having mainly used it in the past for\nthings like <a href=\"https://projecteuler.net/\">Project Euler</a> or <a href=\"https://www.reddit.com/r/dailyprogrammer/\">DailyProgrammer</a>.</p>\n<p>The biggest lesson I learned is to be more realistic about what I can achieve, which will spare\nme a lot of heartache, and also let me go the farthest I can in the time I have.</p>","frontmatter":{"title":"Frequency Visualizer Retrospective","date":"February 17, 2019"}}},"pageContext":{"slug":"/Frequency-Visualizer-Retrospective/","previous":{"fields":{"slug":"/CryptoCards-Blockchain-Cardgame-Retrospective/"},"frontmatter":{"title":"CryptoCards - A Blockchain Cardgame Retrospective"}},"next":{"fields":{"slug":"/YFS-Retrospective/"},"frontmatter":{"title":"YFS - A Distributed Filesystem Retrospective"}}}}